In [2]:
%load_ext sql

In [3]:
#make a connection with the database
%sql sqlite:///Lib.db

'Connected: @Lib.db'

In [18]:
%%sql 

CREATE TABLE IF NOT EXISTS "event" ( 
    "eventID" INTEGER NOT NULL DEFAULT 0 UNIQUE CHECK(eventID <1000000 AND eventID>=0), 
    "date" TEXT NOT NULL DEFAULT 'TBA' ,
    "type" TEXT NOT NULL DEFAULT 'none',
    "room" TEXT NOT NULL DEFAULT 'TBA', 
    "name" TEXT NOT NULL, PRIMARY KEY("EventID") );


CREATE TABLE IF NOT EXISTS "item" (
    "itemID" INTEGER NOT NULL DEFAULT 0 UNIQUE CHECK(itemID <1000000 AND itemID>=0), 
    "borrowerID" TEXT DEFAULT 0 CHECK (condition in ('A')),
    "condition" TEXT CHECK(condition in ('A','B','P')),
    "type" TEXT NOT NULL,
    "value" REAL NOT NULL DEFAULT 0, 
    "name" TEXT NOT NULL, 
    "dueDate" TEXT DEFAULT '0000-00-00',
    PRIMARY KEY("itemID"), 
    FOREIGN KEY("borrowerID") REFERENCES "member"("ID") ON DELETE CASCADE );



CREATE TABLE IF NOT EXISTS "member" ( 
    "ID" INTEGER NOT NULL DEFAULT 0 UNIQUE CHECK(ID <1000000 AND ID>=1),
    "DOB" TEXT NOT NULL,
    "fine" REAL NOT NULL DEFAULT 0,
    "gender" TEXT CHECK(gender in ('M','F')),
    "name" TEXT NOT NULL,
    "email" TEXT CHECK(email LIKE '%@_%._%'), PRIMARY KEY("ID") );


CREATE TABLE  IF NOT EXISTS "memberEvent" ( 
    "ID" INTEGER,
    "eventID" TEXT,
    FOREIGN KEY("ID") REFERENCES "member"("ID") ON DELETE CASCADE
  FOREIGN KEY("eventID") REFERENCES "event"("eventID") ON DELETE CASCADE);



CREATE TABLE IF NOT EXISTS "staff" (
    "staffID" INTEGER NOT NULL DEFAULT 0 UNIQUE CHECK(staffID <1000000 AND staffID>=1),
    "job" TEXT, 
    "name" TEXT NOT NULL DEFAULT "A" , 
    "gender" TEXT CHECK(gender in ('M','F')),
    "DOB" TEXT NOT NULL, 
    "email" TEXT CHECK(email LIKE '%@_%._%'),
    PRIMARY KEY("staffID") );


CREATE TABLE IF NOT EXISTS "staffEvent" ( 
    "staffID" INTEGER,
    "eventID" INTEGER, 
    FOREIGN KEY("staffID") REFERENCES "staff"("staffID") ON DELETE CASCADE
 FOREIGN KEY("eventID") REFERENCES "event"("eventID") ON DELETE CASCADE);

CREATE UNIQUE INDEX IF NOT EXISTS "idx_contacts_email" ON "staff" ( "email" );
CREATE UNIQUE INDEX IF NOT EXISTS "idx_event_name" ON "event" ( "name" );
CREATE UNIQUE INDEX  IF NOT EXISTS "idx_member_email" ON "member" ( "email" );
CREATE UNIQUE INDEX IF NOT EXISTS "idx_item_ID" ON "item" ( "itemID" );
CREATE INDEX  IF NOT EXISTS"idx_item_name" ON "item" ( "name" ASC );

 * sqlite:///Lib.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [11]:
%%sql
INSERT INTO item values (12,0,'A','Book',25,"1984",date('now'));
INSERT INTO item values (13,0,'A','DVD',80,"1984",date('now'));
INSERT INTO item values (90,0,'A','Book',45,"Fahrenheit 451",date('now'));
INSERT INTO item values (56,0,'A','Book',65,"Lord of the Flies",date('now'));
INSERT INTO item values (101,0,'A','Book',20,"Iron Angel",date('now'));
INSERT INTO item values (102,0,'A','DVD',45,"When They Cry",date('now'));
INSERT INTO item values (103,0,'A','Book',30,"Strange Terrain",date('now'));
INSERT INTO item values (104,0,'A','Book',25,"The Broodhold",date('now'));
INSERT INTO item values (105,0,'A','DVD',50,"SEPIKS",date('now'));
INSERT INTO item values (106,0,'A','DVD',50,"SEPIKS REDUX",date('now'));
INSERT INTO item values (107,0,'A','DVD',45,"The Broodhold",date('now'));

 * sqlite:///Lib.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [4]:
%%sql 
select itemID,condition,name,dueDate,type from item

 * sqlite:///Lib.db
Done.

[(12, 'A', '1984', '2020-04-08', 'Book'),
 (13, 'A', '1984', '2020-04-08', 'DVD'),
 (56, 'A', 'Lord of the Flies', '2020-04-08', 'Book'),
 (90, 'A', 'Fahrenheit 451', '2020-04-08', 'Book')]

In [12]:
%%sql
INSERT INTO member values (1001,"1995-03-01",0,'M',"Devrim Kay",'Dkay@hotmail.com');
INSERT INTO member values (1002,"1994-07-03",0,'F',"Ana Bray",'Abraytex@gmail.com');
INSERT INTO member values (1003,"1964-12-23",0,'M',"Clovis Bray",'Braytech@gmail.com');
INSERT INTO member values (1004,"1966-08-27",0,'M',"Ed Gein",'Plainghoul@outlook.com');
INSERT INTO member values (1005,"1959-07-13",0,'F',"Erina Pendelton",'Epenn@gmail.com');
INSERT INTO member values (1006,"2004-02-28",0,'M',"Gherman Titov",'Cosmostep@gmail.com');
INSERT INTO member values (69,"2000-04-01",0,'M',"Hugh Jass",'Sendhelp@hotmail.com');
INSERT INTO member values (13,"2000-03-06",0,'M',"Ben Dover",'Notnice@gmail.com');
INSERT INTO member values (420,"1945-08-07",0,'F',"Jane Titor",'noplease@hotmail.com');
INSERT INTO member values (77,"1963-11-22",0,'M',"John Wilkes",'igottimetokill@outlook.com');

 * sqlite:///Lib.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [26]:
%%sql

select ID, DOB,email from member

 * sqlite:///Lib.db
Done.

[(13, '2000-03-06', 'Notnice@gmail.com'),
 (69, '2000-04-01', 'Sendhelp@hotmail.com'),
 (77, '1963-11-22', 'igottimetokill@outlook.com'),
 (420, '1945-08-07', 'noplease@hotmail.com')]

In [20]:
%%sql

INSERT INTO staff values (1656,"Volunteer","Mingo Edgefield",'F',"1975-08-23",'wantout@gmail.com');
INSERT INTO staff values (96,"Librarian","Leslie Zemeckis",'F',"1985-07-03",'ceasethefuture@gmail.com');
INSERT INTO staff values (467,"Librarian","James Pon",'M',"1976-03-02",'countryroad@gmail.com');
INSERT INTO staff values (2934,"Janitor","Brad Fenton",'M',"1965-11-16",'cleanisgood@gmail.com');
INSERT INTO staff values (20001,"Volunteer","Paula Bradford",'F',"1980-04-13",'breadisgood@gmail.com');
INSERT INTO staff values (20002,"Volunteer","Richard Danse",'M',"1990-12-12",'Ironbro@gmail.com');
INSERT INTO staff values (20003,"Janitor","Seregey Gabinski",'M',"1971-02-08",'noquestions@gmail.com');
INSERT INTO staff values (20004,"Librarian","Tod Ellsworth",'M',"1990-03-12",'errata@gmail.com');
INSERT INTO staff values (20005,"Bookeeper","Xie Xie Sun",'F',"1995-10-16",'sunnydayz@gmail.com');
INSERT INTO staff values (20006,"Bookeeper","Artoria Pendragon",'F',"1992-05-05",'merlin@gmail.com');

 * sqlite:///Lib.db
1 rows affected.

[]

In [43]:
%%sql

select staffID,name,email from staff

 * sqlite:///Lib.db
Done.

[(96, 'Leslie Zemeckis', 'ceasethefuture@gmail.com'),
 (467, 'James Pon', 'countryroad@gmail.com'),
 (1656, 'Mingo Edgefield', 'wantout@gmail.com'),
 (2934, 'Brad Fenton', 'cleanisgood@gmail.com')]

In [23]:
%%sql

INSERT INTO event values (99999,"2020-06-05","book club meeting","B50","Annual book club end of school year party 2020");
INSERT INTO event values (9949,"2020-09-10","movie night","A45","Back to School Movie Night 2020");
INSERT INTO event values (101010,"2020-04-07","book sale","C65","Spring Book Sale 2020");
INSERT INTO event values (15691, "2020-08-11","book and movie discussion","A34", "The Talk 2020");
INSERT INTO event values (300,"2020-05-04","book club meeting","B50","book club meeting");
INSERT INTO event values (301,"2020-05-19","book club meeting","B50","book club meeting 1");
INSERT INTO event values (302,"2020-05-26","book club meeting","B50","book club meeting 2");
INSERT INTO event values (303,"2020-05-8","movie club","A50","movie club meeting");
INSERT INTO event values (304,"2020-05-15","movie club meeting","A50","movie club meeting 1");
INSERT INTO event values (305,"2020-05-22","movie club meeting","A50","movie club meeting 2");

 * sqlite:///Lib.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [55]:
%%sql 

INSERT INTO staffEvent values (1656,101010);
INSERT INTO staffEvent values (96,15691);
INSERT INTO staffEvent values (96,99999);
INSERT INTO staffEvent values (467,99999);

 * sqlite:///Lib.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]